In [1]:
import pandas as pd

In [2]:
df_cust = pd.read_csv('../LOTT/고객DEMO.txt',sep=',',encoding='cp949')
df_cust.head()

   고객번호 성별    연령대   거주지역
0     1  M  60세이상   60.0
1     2  M  60세이상  100.0
2     3  M  60세이상   33.0
3     4  F  60세이상   16.0
4     5  M  60세이상  100.0

In [65]:
def data_info(df,null_count_standard): # 0 넣어줘야 전체 뽑힘
    display(df.head(2))
    print('[shape] : ',df.shape)
    print('[rows] : {} , [columns] : {}'.format(df.shape[0],df.shape[1]),'\n')
    print('[value_counts] : \n',df.dtypes.value_counts(),'\n')
    print('[columns] : ' ,df.columns,'\n')
    nl_v = df.isnull().sum()
    print('[Null_values] : ','\n',nl_v[nl_v>null_count_standard].sort_values(ascending=False))
    print('[Null_columns] : ','\n', list(nl_v[nl_v>null_count_standard].keys()))
    return

In [66]:
data_info(df_cust,0)

   고객번호 성별    연령대   거주지역
0     1  M  60세이상   60.0
1     2  M  60세이상  100.0

[shape] :  (19383, 4)
[rows] : 19383 , [columns] : 4

[value_counts] :
 object     2
int64      1
float64    1
dtype: int64

[columns] :  Index(['고객번호', '성별', '연령대', '거주지역'], dtype='object')

[Null_values] :
 거주지역    178
dtype: int64
[Null_columns] :
 ['거주지역']

In [48]:
def col_info(df):
    print('[columns] : ' ,df.columns,'\n')
    for column in df.columns:
        print("[",column,"]\n")
        print(" -unique : ", df[column].unique())
        print(" -nunique : ", df[column].nunique())
        print(" -type : ", df[column].dtypes,'\n')
    return

In [49]:
col_info(df_cust)

[columns] :  Index(['고객번호', '성별', '연령대', '거주지역'], dtype='object')

[ 고객번호 ]

 -unique :  [    1     2     3 ... 19381 19382 19383]
 -nunique :  19383
 -type :  int64

[ 성별 ]

 -unique :  ['M' 'F']
 -nunique :  2
 -type :  object

[ 연령대 ]

 -unique :  ['60세이상' '55세~59세' '50세~54세' '45세~49세' '40세~44세' '35세~39세' '30세~34세'
 '25세~29세' '20세~24세' '19세이하']
 -nunique :  10
 -type :  object

[ 거주지역 ]

 -unique :  [ 60. 100.  33.  16. 240.  36.  10.  24.  43. 210. 460.  55.  nan  47.
  39. 440.  87.  65.  13.  49. 360.  69. 410. 340. 500.  72. 610.  45.
  75.  82.  30.  79.  27.  52. 270. 540. 310.  20. 570. 300.  85. 630.]
 -nunique :  41
 -type :  float64

In [58]:
df_cust.groupby('성별').count()

     고객번호    연령대   거주지역
성별
F   15898  15898  15759
M    3485   3485   3446

In [75]:
df_cust.groupby(['성별','연령대']).size().unstack(fill_value=0)

연령대,19세이하,20세~24세,25세~29세,30세~34세,35세~39세,40세~44세,45세~49세,50세~54세,55세~59세,60세이상
성별,,,,,,,,,,
F,11,250,542,1283,2171,2996,3465,2636,1490,1054
M,6,33,143,396,598,681,617,478,284,249